import { Component, OnInit } from '@angular/core';
import { Game } from '../game';

@Component({
  selector: 'app-games',
  templateUrl: './games.component.html',
  styleUrls: ['./games.component.css'],
})
export class GamesComponent implements OnInit {

  game: Game = {
    id: 1,
    name: "Wizard",
    rules: "Στο πρώτο γύρο μια κάρτα μοιράζεται σε κάθε παίκτη, στον δεύτερο γύρο δύο κάρτες κ.ο.κ. Το παιχνίδι τελειώνει μόλις εξαντληθεί η τράπουλα καρτών και δεν υπάρχουν αρκετές κάρτες για να μοιραστούν στους παίκτες. Σε κάθε γύρο του παιχνιδιού καθορίζεται και μια κάρτα ατού. Ένας παίκτης τραβάει μια κάρτα τυχαία από τη στοίβα των καρτών που  δεν έχουν μοιραστεί στους παίκτες και αυτή η κάρτα ορίζεται ως κάρτα ατού στο παιχνίδι. Σε περίπτωση που τραβήχτηκε είναι κάρτα ζογκλέρ (Jester), τότε δεν θα υπάρχει καμία κάρτα ατού για αυτό το γύρο. Εάν η κάρτα που τραβήχτηκε είναι κάρτα μάγος (wizard), τότε ο τελευταίος παίχτης που πόνταρε επιλέγει τη κάρτα ατού για αυτό το γύρο ή μπορεί να επιλέξει να μην παιχτεί ατού στο γύρο.",
    price: 10,
    rate: 0,
    min_age: 10,
    max_age: 100,
    min_num_of_players: 2,
    max_num_of_players: 10,
    creator: "KAISSA",
    tags: ["Μπλόφα", "Κάρτες"],

  }

  constructor() { }

  ngOnInit() {
  }

}
